
<?php 
$blocktext = ['AstroCode: Почніть міжгалактичну пригоду як молодий космічний дослідник, який повинен навчитися програмуванню, подолавши небезпечні інопланетні світи. Використовуйте свої навички кодування, щоб вирішувати головоломки, керувати роботичними компаньйонами та ремонтувати футуристичні механізми в цій космічно-тематичній платформері.',
'CosmoCoder: Приєднуйтесь до капітана Нови в місії з врятовування Всесвіту від наближаючої цифрової катастрофи. Перетинайте космічні платформи, уникайте астероїдних перешкод і пишіть код, щоб заряджати ваш космічний корабель. Оволодівайте концепціями програмування, такими як цикли, умови та змінні, під час дослідження простору нескінченності.',
'StarJumper: Вирушайте у галактичну подорож, сповнену викликів програмування, у цьому захоплюючому платформері з космічною тематикою. Взявши під контроль рухливого робота-астронавта, маневруйте на платформах, що ламають гравітацію, розв`язуйте головоломки кодування. Навчайтеся концепціям програмування, таким як функції, алгоритми та налагодження, і отримуйте нові навички для подолання позаземних перешкод.',
'OrbitRunner: Почніть освітню космічну одісею як молодий програміст на місії відновлення порядку на розпадаючійся космічній станції. Бігайте, стрибайте та кодуйте у нульовій гравітації, вивчаючи концепції програмування, такі як об`єктно-орієнтоване програмування, структури даних та рекурсія.',
'LunarLearner: Виконуйте роль молодого астронавта, застряглого на Місяці, і використовуйте свої навички програмування, щоб вижити та знайти шлях додому. Долайте лунні пейзажі, програмуйте роботичних компаньйонів для допомоги і вивчайте концепції, такі як програмування за подіями, обробка помилок та архітектура програмного забезпечення в цьому захоплюючому платформері з космічною тематикою.',
'NebulaCoder: Досліджуйте глибини таємничого туману, бувайте космічним інженером із надійним інструментом для програмування. Подолайте гравітаційні головоломки, зламуйте інопланетні технології та програмуйте, щоб розкрити секрети космосу. Відкрийте концепції програмування, такі як абстракція, модульність та оптимізація, розгадуючи таємниці цього небесного пригодницького платформера.'
];?>



@extends('layouts.main')
@section('content')
<div class="container mt-5">
    <h3 class="mb-5">Наші курси</h3>
    <div class="d-flex flex-wrap">
        <?php
            for($i = 0; $i < 6; $i++):
        ?>
                <div class="card mb-4 rounded-3 shadow-sm">
                <img src="assets/img/<?php echo($i + 1) ?>.jpg" class="img-thumbnail">
              
                    <div class="card-body">
                    <p class="card-text"><?php echo $blocktext[$i] ?></p>
                  
                        <div class="d-flex justify-content-between align-items-center">
                            <div class="btn-group">
                            <button type="button" class="btn btn-sm btn-outline-secondary">Переглянути</button>
                            <button type="button" class="btn btn-sm btn-outline-secondary">Редагувати</button>
                            </div>
                            <small class="text-body-secondary">У розробці</small>
                        </div>
                    </div>
                </div>
           
        <?php endfor; ?>
@endsection